import { Logger } from '@171h/log'

const logger = new Logger('reg')

const txt = `4 .1 .1 住宅适用性能的评定应包括单元平面、住宅套型、建筑装修、隔声性能、设备设施和无障碍设施6个评定项目，满分为250分。\
\\
TETT

\\
\\
\\


4 .1 .2 住宅适用性能评定指标见本标准附录A。
`

// logger.info('txt', txt)

// fs.writeFileSync('./regtest.txt', txt)

// const txtFix = txt.replaceAll(/\\$/g, 'abc')

// logger.info('txtFix', txtFix)

const strs = [
    '(S-00-02)钢结构设计总说明-S-00-02-11.pdf',
    '(S-00-02)钢结构设计总说明-S-00-02-12.pdf',
    '(S-00-03)结构总说明-危大结构专篇-S-00-03-01.pdf',
    '(S-00-04)结构总说明-绿色设计专篇-S-00-04-01.pdf',
    '(S-00-04)结构总说明-绿色设计专篇-S-00-04-02.pdf',
    '(S-00-05-01~05)装配式混凝土结构设计总说明-S-00-05-01.pdf',
    '(S-00-05-01~05)装配式混凝土结构设计总说明-S-00-05-02.pdf',
    '(S-00-05-01~05)装配式混凝土结构设计总说明-S-00-05-03.pdf',
    '(S-00-05-06~09)典型构件-S-00-05-10.pdf',
    '(S-00-05-06~09)典型构件-S-00-05-11.pdf',
    '(S-00-05-06~09)典型构件-S-00-05-12.pdf',
    '(S-44-01-02,S-44-02-01,02,S-44-03-01~10)G4 结构竣工图-20250317-S-44-01-02.pdf',
    '(S-44-01-02,S-44-02-01,02,S-44-03-01~10)G4 结构竣工图-20250317-S-44-02-01.pdf',
    '(S-44-13-01~06)G4 楼梯竣工图-S-44-13-01.pdf',
    '(S-44-13-01~06)G4 楼梯竣工图-S-44-13-02.pdf',
    '(S-52-01-01,S-52-02-01~02,S-52-03-01~07,S-52-13-01~03)V2V5结构图-S-52-01-01.pdf',
    '(S-52-01-01,S-52-02-01~02,S-52-03-01~07,S-52-13-01~03)V2V5结构图-S-52-02-01.pdf',
    'S-00-01-07_混凝土结构总说明(七).pdf',
    'S-00-01-17_混凝土结构总说明(十七).pdf',
    'S-00-90-02-01.pdf',
    'S-30-01-01.pdf',
    'S-30-01-02.pdf',
    '[S-44-03-09,10]G4屋顶幕墙柱墩 竣工图-20250315-S-44-03-09.pdf',
    '[S-44-03-09,10]G4屋顶幕墙柱墩 竣工图-20250315-S-44-03-10.pdf',
    'S-00-01-01_混凝土结构施工图设计总说明（一）.pdf',
    'S-00-01-02_混凝土结构施工图设计总说明（二）.pdf',
    'S-00-01-03_混凝土结构施工图设计总说明（三）.pdf'
]

const regex = /(S-[0-9]{2}-[0-9]{2}-[0-9]{2}-?[0-9]*)[\._]/

strs.forEach(str => {
    const matches = regex.exec(str)
    if (matches) {
        logger.info('Match found:', matches[1], '--->', str)
    } else {
        logger.warn('No match found for:', str)
    }
})